import datetime

Now = datetime.datetime.now()
# print(Now)
# print(Now.year)
# print(Now.month)
# print(Now.day)
# print(Now.time())
# print(Now.minute)
# print(Now.hour)
# print(Now.second)
d = datetime.datetime(2010, 5, 9)
print(d.strftime("%A"))
# wed
# نام روز هفته به صورت خلاصه
# a%
# Wednesday
# نام روز هفته به صورت کامل
# A%
# 3
# چندمین روز هفته
# w%
# 31
# چندمین روز ماه
# d%
# Dec
# نام ماه به صورت خلاصه
# b%
# December
# نام ماه به صورت کامل
# B%
# 12
# چندمین ماه
# m%
# 18
# چندمین سال به صورت خلاصه (فقط دو عدد سمت راست سال)
# y%
# 2018
# شماره سال به صورت کامل
# Y%
# 16
# نمایش ساعت در قالب 00 تا 24 ساعت
# H%
# 07
# نمایش ساعت با قالب 00 تا 12
# I%
# PM
# صبح یا بعد از ظهر (AM/PM)
# p%
# 37
# چند دقیقه با قالب 00 تا 59
# M%
# 08
# ثانیه
# S%
# 244521
# میکروثانیه با قالب 000000 تا 999999
# f%
# 0100+
# اختلاف زمانی (UTC offset )
# z%
# CST
# Timezone
# Z%
# 365
# چندمین روز سال از 001 تا 366
# j%
# 52
# چندمین هفته از سال Sunday اولین روز هفته است
# U%
# 52
# چندمین هفته از سال Monday اولین روز هفته
# W%
# Mon Dec 31 17:41:00 2018
# تاریخ و زمان فعلی سیستمبه صورت local
# c%
# 12/31/18
# تاریخ فعلی سیستم به صورت local
# x%
# 17:41:00
# زمان فعلی سیستم به صورت local
# X%
